# Arithmetic Operation

In [40]:
import pandas as pd

In [41]:
d1 = pd.DataFrame({'x':[2,6,8,4], 'y':[1,2,3,4]})
d1

   x  y
0  2  1
1  6  2
2  8  3
3  4  4

# Addition

In [42]:
d1['z'] = d1['x']+d1['y']
d1

   x  y   z
0  2  1   3
1  6  2   8
2  8  3  11
3  4  4   8

# Subtraction

In [43]:
d1['z'] = d1['x'] - d1['y']
d1

   x  y  z
0  2  1  1
1  6  2  4
2  8  3  5
3  4  4  0

# Multiplication

In [44]:
d1['z'] = d1['x'] * d1['y']
d1

   x  y   z
0  2  1   2
1  6  2  12
2  8  3  24
3  4  4  16

# Division

In [45]:
d1['z'] = d1['x'] / d1['y']
d1

   x  y         z
0  2  1  2.000000
1  6  2  3.000000
2  8  3  2.666667
3  4  4  1.000000

# Modulus

In [46]:
d1['z'] = d1['x'] % d1['y']
d1

   x  y  z
0  2  1  0
1  6  2  0
2  8  3  2
3  4  4  0

# Combine

In [47]:
d1['Addition'] = d1['x'] + d1['y'] # Addition
d1['Subtraction'] = d1['x'] - d1['y'] # Subtraction
d1['Multiplication'] = d1['x'] * d1['y'] # Multiplication
d1['Division'] = d1['x'] / d1['y'] # Division
d1['Modulus'] = d1['x'] % d1['y'] # Modulus
d1

   x  y  z  Addition  Subtraction  Multiplication  Division  Modulus
0  2  1  0         3            1               2  2.000000        0
1  6  2  0         8            4              12  3.000000        0
2  8  3  2        11            5              24  2.666667        2
3  4  4  0         8            0              16  1.000000        0